Repository: Transpyler/transpyler
Catalog: src/transpyler/l10n/*.po
Languages: es_br, pt_br

source: range
es_br: distancia
pt_br: intervalo

source: range(stop) -> range object range(start, stop[, step]) -> range object Return an object that produces a sequence of integers from start (inclusive) to stop (exclusive) by step. range(i, j) produces i, i+1, i+2, ..., j-1. start defaults to 0, and stop is omitted! range(4) produces 0, 1, 2, 3. These are exactly the valid indices for a list of 4 elements. When step is given, it specifies the increment (or decrement).
es_br: rango (stop) -> rango de objetos (start, stop [, step]) -> range object Devuelve un objeto que produce una secuencia de enteros desde start (inclusive) hasta stop (exclusivo) por paso. (I, j) produce i, i + 1, i + 2, ..., j-1. El valor predeterminado de arranque es 0 y se omite la parada! (4) produce 0, 1, 2, 3. Estos son exactamente los índices válidos para una lista de 4 elementos. Cuando se da paso, especifica el incremento (o decremento).
pt_br: intervalo(n) -> [0, 1, ..., n - 1] intervalo(a, b) -> [a, a + 1, ..., b - 1] intervalo(a, b, x) -> [a, a + x, ..., b - 1] Retorna uma sequencia de inteiros de acordo com um dos três exemplos acima. Exemplos: >>> intervalo(5) [0, 1, 2, 3, 4] >>> intervalo(2, 5) [2, 3, 4] >>> intervalo(0, 5, 2) [0, 2, 4]

source: sleep
es_br: dormir
pt_br: dormir

source: Delay execution for a given number of seconds. The argument may be a floating point number for subsecond precision.
pt_br: Atrasa a execução por um dado número de segundos. O argumento não precisa ser um número inteiro. O argumento pode conter casas decimais para especificar intervalos de tempo com frações de segundo.

source: seconds
pt_br: segundos

source: exit
es_br: salida
pt_br: sair saia

source: Finish program execution and provides an exit code. If msg is not given, the program finishes in a successful state. An exit code different from zero or a string tells that there were an error during execution.
pt_br: Conclui a execução do programa e fornece um código de saída. Se a mensagem de erro não for fornecida, o programa terminará em um estado bem-sucedido. Um código de saída diferente de zero ou uma string informa que houve um erro durante a execução.

source: msg
pt_br: mensagem

source: integer
pt_br: inteiro

source: Converts argument to an integer.
pt_br: Converte argumento para um inteiro.

source: Convert argument to a real number (number with decimal places).
pt_br: Converte o argumento para um número real (número com casas decimais).

source: complex
pt_br: complexo

source: Convert argument to a complex number.
pt_br: Converte o argumento em um número complexo.

source: boolean
pt_br: booleano lógico

source: Convert argument to a boolean value. Zero and empty sequences are converted to False. All other values are True.
pt_br: Converte argumento para um valor lógico. Zero e sequências vazias são convertidas para Falso. Todos outros valores são Verdadeiros.

source: binary
pt_br: binário

source: Convert integer to a string with its binary representation.
pt_br: Retorna string com representação binária do número.

source: Convert integer to a string with its octal representation.
pt_br: Retorna string com representação octal do número.

source: Convert integer to a string with its hexadecimal representation
pt_br: Retorna texto com representação hexadecimal do número

source: character
pt_br: caractere

source: Convert number to its corresponding character in the ASCII/Unicode tables.
pt_br: Converta o número em seu caractere correspondente nas tabelas ASCII / Unicode.

source: concatenate
es_br: concatenar
pt_br: concatenar concatene

source: Convert argument to string and concatenate. If only one argument is passed, assumes it is a sequence. Examples: >>> concatenate('x = ', 2) 'x = 2' >>> concatenate([1, 2, 3, 4]) '1234'
es_br: Convierta el argumento en cadena y concatene. Si sólo se pasa un argumento, se supone que es una secuencia. Ejemplos: >>> concatenar ('x =', 2) 'X = 2' >>> concatenar ([1, 2, 3, 4]) '1234'
pt_br: Converte argumentos para string e concatena. Se somente um argumento for passado, o mesmo é tratado como uma sequência. Examples: >>> concatenar('x = ', 2) 'x = 2' >>> concatenar([1, 2, 3, 4]) '1234'

source: join
es_br: unirse
pt_br: juntar junte

source: Similar to concatenate(), but takes an extra separator as first argument argument. Examples: >>> join(', ', 1, 2, 3) '1, 2, 3'
es_br: Similar a concatenate (), pero toma un separador extra como argumento del primer argumento. Ejemplos: >>> join (',', 1, 2, 3) '1, 2, 3'
pt_br: Semelhante à concatenar(), mas também recebe um separador extra como argumento. Examples: >>> juntar(', ', 1, 2, 3) '1, 2, 3'

source: separator, args
es_br: separador, args
pt_br: separador, args

source: format_string
es_br: cadena_de_formato
pt_br: formatar formate

source: Format text inserting parameters in the wildcard positions. There are two different syntax for string formatting. The first is based on C and uses symbols such as %s, %f, %d to delimit insertion points. >>> format_string('%i != %.2f', 42, 43) '42 != 43.00' The second uses curly braces. >>> format_string('{0} != {1}', 42, 43) '42 != 43'
es_br: Formatear texto insertando parámetros en las posiciones de comodín. Hay dos sintaxis diferente para el formato de cadena. El primero se basa en C y utiliza símbolos como% s,% f,% d para delimitar puntos de inserción. >>> format_string ('% i! =% .2f', 42, 43) '42! = 43.00 ' El segundo utiliza llaves. >>> format_string ('{0}! = {1}', 42, 43) '42! = 43 '
pt_br: Formata o texto inserindo os parâmetros dados nas posições coringa. Existem duas sintaxes diferentes para a formatação de texto. A primeira, baseada em C, utiliza o símbolo %s, %f, %d, etc para delimitar os pontos de inserção por posição. >>> formatar('%i = %.2f', 42, 42) '42 = 42.00' A segunda usa esta sintaxe (explicar!) >>> formatar('{0} = {1}', 42, 42) '42 = 42'

source: string, args, kwargs
es_br: cuerda, args, kwargs
pt_br: texto, args, kwargs

source: print
es_br: imprimir
pt_br: mostrar mostre

source: Prints the object or text provided on the screen. If called with multiple arguments, prints them in sequence, separating them with a white space. Examples: >>> print("Hello world!") Hello World!
es_br: Muestra el objeto o texto proporcionado en la pantalla. Si se llama con varios argumentos, los imprime en secuencia, separándolos con un espacio en blanco. Ejemplos: >>> show ("¡Hola mundo!") Hola Mundo!
pt_br: Mostra o objeto ou texto fornecido na tela. Se chamado com vários argumentos, imprime-os em sequência, separando-os com um espaço em branco. Exemplos: >>> mostrar("Olá mundo!") Olá Mundo!

source: alert
es_br: alerta
pt_br: alerta

source: Similar to the `show` function, but displays the resulting message in a dialog box.
es_br: Similar a la función `show`, pero muestra el mensaje resultante en un cuadro de diálogo.
pt_br: Semelhante à função `mostrar`, mas exibe a mensagem resultante em uma caixa de diálogo.

source: print_formatted
es_br: mostrar_el_formato
pt_br: mostrar_formatado

source: Displays a string after applying the provided formatting arguments.
es_br: Muestra una cadena después de aplicar los argumentos de formato proporcionados.
pt_br: Exibe uma sequência depois de aplicar os argumentos de formatação fornecidos.

source: text, args, kwargs
es_br: texto, args, kwargs
pt_br: texto, args, kwargs

source: read_text
es_br: leer_texto
pt_br: ler_texto leia_texto

source: Prompts the user for a text entry. Examples: >>> name = read_text('Your name:') >>> show("Hello," + name) # the user types "Maria" Hello Maria
es_br: Solicita al usuario una entrada de texto. Ejemplos: >>> name = read_text ('Tu nombre:') >>> show ("Hola," + nombre) # el usuario escribe "Maria" Hola Maria
pt_br: Solicita ao usuário uma entrada de texto. Exemplos: >>> nome = leia_texto('Seu nome:') >>> mostre("Olá," + nome) # o usuário digita "Maria" Olá Maria

source: message
es_br: mensaje
pt_br: mensagem

source: read_number
es_br: leer_número
pt_br: ler_número leia_número

source: Prompts the user for a numeric entry. Examples: >>> x = read_number('A number:') # user types 2... >>> x + 40 42
es_br: Solicita al usuario una entrada numérica. Ejemplos: >>> x = read_number ('A number:') # tipos de usuario 2 ... X mas 40 42
pt_br: Solicita ao usuário uma entrada numérica. Exemplos: >>> x = leia_número('A number:') # usuário digita 2 >>> x + 40 42

source: message, text, num
es_br: mensaje, texto, numero
pt_br: mensagem, texto, num

source: read_file
es_br: lee_el_archivo
pt_br: ler_arquivo leia_arquivo

source: Reads the content from a text file and returns it as string. Examples: >>> data = read_file("foo.txt")
es_br: Lee el contenido de un archivo de texto y lo devuelve como cadena. Ejemplos: >>> data = read_file ("foo.txt")
pt_br: Lê o conteúdo de um arquivo de texto e o retorna como sequência de caracteres. Exemplos: >>> data = leia_arquivo("foo.txt")

source: file
es_br: archivo
pt_br: arquivo

source: save_in_file
es_br: guardar_en_archivo
pt_br: salvar_em_arquivo salve_em_arquivo

source: Saves the text content to the indicated file, deleting any previous content. WARNING! If the given file exists, this function will overwrite your content without asking! Examples: >>> save_in_file(data, "foo.txt")
es_br: Guarda el contenido del texto en el archivo indicado, eliminando cualquier contenido anterior. ¡ADVERTENCIA! ¡Si el archivo dado existe, esta función sobrescribirá su contenido sin preguntar! Ejemplos: >>> save_in_file (datos, "foo.txt")
pt_br: Salva o conteúdo de texto no arquivo indicado, excluindo qualquer conteúdo anterior. ATENÇÃO! Se o arquivo existir, esta função substituirá seu conteúdo sem avisar! Examples: >>> salvar_em_arquivo(dados, "foo.txt")

source: text, file, F
es_br: texto, archivo, _F
pt_br: texto, arquivo, F

source: pause
es_br: pausa
pt_br: pausar pause pausa

source: Stops execution until the user presses the <return> key.
es_br: Detiene la ejecución hasta que el usuario presione la tecla <return>.
pt_br: Interrompe a execução até que o usuário pressione a tecla <enter>.

source: Number
pt_br: Número

source: All numbers inherit from this class. If you just want to check if an argument x is a number, without caring what kind, use isinstance(x, Number).
pt_br: Todos números herdam desta classe. Se você deseja chegar se um argumento x é um número, se se preocupar com o tipo específico, use `isinstance(x, Número)`.

source: To Complex, Real adds the operations that work on real numbers. In short, those are: a conversion to float, trunc(), divmod, %, <, <=, >, and >=. Real also provides defaults for the derived operations.
pt_br: Números reais.

source: conjugate
pt_br: conjugado

source: Conjugate is a no-op for Reals.
pt_br: Conjugação não afeta números reais.

source: imag
pt_br: imaginário

source: Convert a string or number to a floating point number, if possible.
pt_br: Converte argumento para um número de ponto flutuante, se possível.

source: cos
pt_br: cos coseno

source: Cosine of an angle (in degrees)
es_br: Coseno de un ángulo (en grados)
pt_br: Cosseno de um ângulo (em graus)

source: angle
es_br: ángulo
pt_br: ângulo

source: sin
es_br: pecado
pt_br: seno

source: Sine of an angle (in degrees)
es_br: Seno de un ángulo (en grados)
pt_br: Seno de um ângulo (em graus)

source: tan
es_br: broncearse
pt_br: tangente

source: Tangent of an angle (in degrees)
es_br: Tangente de un ángulo (en grados)
pt_br: Tangente de um ângulo (em graus)

source: sqrt
pt_br: raiz raiz_quadrada

source: Return the square root of a positive number.
pt_br: Retorna a raiz quadrada do argumento.

source: exp
pt_br: exp exponencial

source: Return the exponential of a number.
pt_br: Retorna a exponencial do argumento.

source: log
es_br: iniciar_sesión
pt_br: log logaritmo

source: Return the natural logarithm of x. Aliases: log | ln
pt_br: Retorna o logaritmo natural de x. Aliases: log | ln

source: Return the logarithm of x in base 10.
pt_br: Retorna o logaritmo do argumento na base 10.

source: Return the logarithm of x in base 2.
pt_br: Retorna o logaritmo do argumento na base 2.

source: sign
pt_br: sinal

source: Return 1 if x is positive, -1 if it is negative and 0 if it is null. Examples: >>> sign(-32.0) -1
pt_br: Retorna 1 se x for positivo, -1 se for negativo e 0 caso seja nulo. Examples: >>> sinal(-32.0) -1

source: abs
es_br: abdominales
pt_br: módulo

source: Return the absolute value of the argument.
es_br: Devuelve el valor absoluto del argumento.
pt_br: Retorna o módulo (valor absoluto) do argumento.

source: round
es_br: redondo
pt_br: arredondar arredonde

source: Round a number to a given precision in decimal digits (default 0 digits). ndigits may be negative. Examples: >>> round(1.9) 2 >>> round(3.141516, 2) 3.14
pt_br: Arredonda um número para uma precisão determinada em dígitos decimais (padrão de 0 dígitos). Exemplos: >>> arredondar(1.9) 2 >>> arredondar(3.141516, 2) 3.14

source: number, ndigits
pt_br: numero, ndigitos

source: ceil
es_br: hacer_techo
pt_br: arrendondar_para_cima arredonde_para_cima

source: Return the ceiling of x as an Integral. This is the smallest integer >= x.
pt_br: Arredonda o argumento para o inteiro imediatamente maior. É o maior inteiro maior que x.

source: number
pt_br: numero

source: trunc
pt_br: truncar trunque

source: Truncates x to the nearest Integral toward 0.
pt_br: Trunca x para o inteiro mais próximo em direção a 0.

source: sum
es_br: suma
pt_br: soma

source: Return the sum of all numbers in the sequence.
pt_br: Retorna a soma de todos os números na sequência.

source: seq, start
pt_br: x, começo

source: product
es_br: producto
pt_br: produto

source: Return the product of all numbers in the sequence.
es_br: Devuelva el producto de todos los números en la secuencia.
pt_br: Retornar o produto de todos os números no argumento.

source: seq, start, result, x
es_br: seq, comienzo, resultado, _x
pt_br: seq, começo, resultado, x

source: min
pt_br: mínimo

source: Return the minimum value in the arguments. It called with a single sequence, return the minimum value on that sequence.
pt_br: Como máximo, mas retorna o menor valor.

source: max
es_br: máximo
pt_br: máximo

source: Return the maximum value in the arguments. It called with a single sequence, return the maximum value on that sequence.
pt_br: Retorna o valor máximo nos argumentos. Se chamada com uma seqüência, retorna o valor máximo desta seqüência.

source: dice
pt_br: dados

source: Simulate a dice trow (return a random number between 1 and 6. Call with an explicit argument to throw a dice with a different number of faces Examples: >>> dice(20) # doctest: +SKIP 13
pt_br: Simule um lance de dados (retorna um número aleatório entre 1 e 6. Chame com um argumento explícito para lançar um dado com um número diferente de faces Exemplos: >>> dados (20) # doctest: + SKIP 13

source: random
es_br: aleatorio
pt_br: número_aleatório

source: Return a random number between 0 and 1.
pt_br: Retorna um número aleatório entre 0 e 1.

source: randint
pt_br: inteiro_aleatório

source: Return a random integer between a and b (inclusive).
pt_br: Retorna o inteiro aleatório no intervalo [a, b], incluindo ambos os pontos finais.

source: Vec
pt_br: Vetor

source: A tuple-based 2D vector. Supports all basic arithmetic operations.
es_br: Vector 2D basado en tuplas. Soporta todas las operaciones aritméticas básicas.
pt_br: Um vetor 2D. Suporta todas as operações aritméticas básicas.

source: count
es_br: contar
pt_br: contar

source: from_angle
es_br: de_angle
pt_br: coordenadas_polares

source: index
es_br: índice
pt_br: índice

source: norm
es_br: norma
pt_br: módulo

source: Vector norm.
es_br: Norma vectorial.
pt_br: Norma (tamanho) do vetor.

source: normalized
es_br: normalizado
pt_br: normalizado

source: Return unity vector.
es_br: Vuelve el vector de la unidad.
pt_br: Retorna um vetor unitário na direção do vetor original.

source: perp
pt_br: perpendicular

source: Returns a perpendicular vector rotated 90 degrees counter-clockwise.
pt_br: Retorna um vetor perpendicular girado 90 graus no sentido anti-horário.

source: self, invert
es_br: self, invertir
pt_br: self, invertido

source: rotate
es_br: girar
pt_br: girar

source: Return rotated vector by the given angle.
es_br: Devuelve el vector girado por el ángulo dado.
pt_br: Retorna o vetor girado pelo ângulo dado.

source: self, angle, x, y, c, s
pt_br: self, ângulo, x, y, c, s

source: vec
pt_br: vetor

source: Return a vector with the given (x, y) components.
es_br: Devuelve un vector con los componentes dado (x, y).
pt_br: Cria um vetor com as componentes (x, y) fornecidas.

source: dot
es_br: punto
pt_br: produto_escalar

source: The dot product (scalar product) of two vectors.
es_br: El producto punto (producto escalar) de dos vectores.
pt_br: O produto escalar de dois vetores.

source: mainturtle
es_br: tortuga_principal
pt_br: tuga_principal

source: Returns the main turtle object.
es_br: Devuelve el objeto tortuga principal.
pt_br: Retorna o Tuga principal.

source: Turtle
es_br: Tortuga
pt_br: Tuga

source: Creates a new Turtle.
pt_br: Cria uma nova tartaruga.

source: backward
es_br: hacia_atrás
pt_br: trás

source: Move the turtle backward by the given step size (in pixels). Aliases: backward | back | bk
es_br: Mover a la tortuga hacia atrás por el tamaño de paso dado (en píxeles). Alias: hacia atrás | Atrás | Bk
pt_br: Move o Tuga para trás pelo passo fornecido em pixels

source: self, step
es_br: self, passo
pt_br: self, passo

source: clean
pt_br: limpar limpe

source: Clear all drawings made by turtle.
es_br: Borrar todos los dibujos hechos por la tortuga.
pt_br: Limpa todos os desenhos feitos pelo tuga.

source: color
pt_br: cor

source: drawing
es_br: dibujo
pt_br: desenhando

source: forward
es_br: adelante
pt_br: frente

source: Move the turtle forward by the given step size (in pixels). Aliases: forward | fd
es_br: Mover a la tortuga hacia adelante por el tamaño de paso dado (en píxeles). Alias: adelante | Fd
pt_br: Mova o Tuga para frente pelo passo dado em pixels

source: fillcolor
es_br: color de relleno
pt_br: cor_preenchimento

source: getavatar
pt_br: obter_avatar obtenha_avatar

source: Return a string with the name of the current avatar.
es_br: Devuelve una cadena con el nombre del avatar actual.
pt_br: Retorna o nome do avatar atual.

source: getcolor
es_br: obtener_color
pt_br: obter_cor obtenha_cor

source: Return a tuple of (R, G, B) with the current pen color.
es_br: Devuelve una tupla de (R, G, B) con el color del lápiz actual.
pt_br: Retorna a cor de desenho atual.

source: getfillcolor
pt_br: obter_cor_preenchimento

source: Return a tuple of (R, G, B) with the current fill color.
es_br: Devuelve una tupla de (R, G, B) con el color de relleno actual.
pt_br: Retorna a cor de preenchimento atual.

source: getheading
pt_br: obter_orientação obtenha_orientação

source: Return current heading of the turtle (in degrees).
es_br: Devuelve el rumbo actual de la tortuga (en grados).
pt_br: Retorna a orientação atual do Tuga (em graus). O valor de referência consiste na orientação inicial em que o Tuga aponta para a direita.

source: getpos
pt_br: obter_posição obtenha_posição

source: Return a vector (x, y) with turtle's position (in pixels).
es_br: Devuelve un vector con los componentes dado (x, y).
pt_br: Retorna um vetor (x, y) com a posição do Tuga (em pixels).

source: getwidth
pt_br: obter_espessura obtenha_espessura

source: Return the pen width (in pixels):
es_br: Devolver el ancho de la pluma (en píxeles):
pt_br: Retorna a espessura do traço (em pixels)

source: goto
es_br: ir
pt_br: ir_para vá_para

source: Goes to the given position. If the pen is down, it draws a line.
es_br: Va a la posición dada. Si la pluma está abajo, dibuja una línea.
pt_br: Vai para a posição dada. Se a caneta estiver abaixada, desenha uma linha.

source: heading
es_br: título
pt_br: orientação

source: hidden
es_br: oculto
pt_br: oculto

source: hide
es_br: esconder
pt_br: ocultar oculte

source: Hide turtle.
es_br: Oculta la tortuga.
pt_br: Esconda o Tuga.

source: isdown
es_br: esta_abajo
pt_br: está_abaixado

source: Return True if the pen is down or False otherwise.
es_br: Devuelve True si la pluma está hacia abajo o Falso de lo contrario.
pt_br: Retorna Verdadeiro se a caneta estiver desativada, ou Falso caso contrário.

source: ishidden
es_br: está_oculto
pt_br: está_oculto

source: Return True if the turtle is not visible.
es_br: Devuelve verdadero si la tortuga no es visible.
pt_br: Retorna Verdadeiro se o Tuga não estiver visível.

source: isvisible
es_br: es_visible
pt_br: está_visível

source: Return True if the turtle is visible.
es_br: Devuelve verdadero si la tortuga es visible.
pt_br: Retornar Verdadeiro se o Tuga for visível.

source: jump
es_br: saltar
pt_br: pular_para

source: Relative movement by the desired position. It *never* draw as line even if the pen is down.
es_br: Movimiento relativo por la posición deseada. Nunca dibuja como línea incluso si la pluma está abajo.
pt_br: Faz o Tuga pular pelas coordenadas escolhidas. Esta função *nunca* desenha uma linha, mesmo se a caneta estiver abaixada.

source: left
es_br: izquierda
pt_br: esquerda

source: Rotate the turtle counter-clockwise by the given angle. Aliases: left | lt Negative angles produces clockwise rotation.
es_br: Gire la tortuga en el sentido contrario a las agujas del reloj por el ángulo dado. Alias: izquierda | Lt Los ángulos negativos producen rotación en sentido horario.
pt_br: Gira o Tuga no sentido anti-horário pelo ângulo dado. Ângulos negativos produzem rotação no sentido horário.

source: self, angle
es_br: self, invertir
pt_br: self, ângulo

source: pendown
es_br: adjuntar
pt_br: abaixar_caneta

source: Lower the turtle pen so it can draw in the screen. Aliases: pendown | pd
es_br: Baje la pluma de la tortuga para que pueda dibujar en la pantalla. Alias: pendown | Pd
pt_br: Abaixa a caneta do Tuga para que ele possa desenhar na tela quando se movimentar

source: penup
es_br: cerca
pt_br: levantar_caneta

source: Raises the turtle pen so it stops drawing. Aliases: penup | pu
es_br: Levanta la pluma de tortuga para que deje de dibujar. Alias: penup | Pu
pt_br: Levanta a caneta do Tuga para que pare de desenhar enquanto se desloca

source: pos
es_br: popular
pt_br: posição

source: reset
es_br: reiniciar
pt_br: reiniciar reinicie

source: Clear all drawings and reset turtle to initial position.
es_br: Borrar todos los dibujos y restablecer la tortuga a la posición inicial.
pt_br: Limpe todos os desenhos e repõe o Tuga na posição inicial.

source: right
es_br: derecha
pt_br: direita

source: Rotate the turtle clockwise by the given angle. Aliases: right | rt Negative angles produces counter-clockwise rotation. Return final heading.
es_br: Gire la tortuga en sentido horario por el ángulo dado. Alias: derecha | Rt Los ángulos negativos producen una rotación a la izquierda. Devolver el encabezado final.
pt_br: Gira a tartaruga no sentido horário pelo ângulo dado. Os ângulos negativos produzem rotação no sentido anti-horário.

source: setavatar
pt_br: definir_avatar defina_avatar

source: Modifies the turtle avatar.
es_br: Modifica el avatar de la tortuga.
pt_br: Modifica o avatar utilizado pelo Tuga.

source: self, value
es_br: self, invertir
pt_br: self, valor

source: setcolor
pt_br: definir_cor defina_cor

source: Modifies the pen color. Color can be specified as an (R, G, B) tuple or as a hex string or by name.
es_br: Modifica el color del lápiz. El color se puede especificar como una tupla (R, G, B) o como una cadena hexadecimal o por nombre.
pt_br: Modifica a cor do traço. A cor pode ser especificada como uma tupla (R, G, B) ou pelo nome.

source: setfillcolor
pt_br: definir_cor defina_cor
