Repository: Transpyler/transpyler
Catalog: src/transpyler/l10n/*.po
Languages: es_br, pt_br

source: Modifies the fill color. Color can be specified as an (R, G, B) tuple or as a hex string or by name.
es_br: Modifica el color de relleno. El color se puede especificar como una tupla (R, G, B) o como una cadena hexadecimal o por nombre.
pt_br: Modifica a cor de preenchimento. A cor pode ser especificada como uma tupla de (R, G, B) ou pelo nome.

source: setheading
pt_br: definir_orientação defina_orientação

source: Sets turtle's heading (in degrees).
es_br: Seno de un ángulo (en grados)
pt_br: Define a orientação do Tuga (em graus).

source: setpos
pt_br: definir_posição defina_posição

source: Modifies turtle's position (in pixels) User can pass the x, y coordinates of the new position or a tuple of (x, y) values. This method never draws a line.
es_br: Modifica la posición de la tortuga (en píxeles) El usuario puede pasar las coordenadas x, y de la nueva posición o una tupla de valores (x, y). Este método nunca dibuja una línea.
pt_br: Modifica a posição do Tuga (em pixels) É possível passar as coordenadas x, y da nova posição ou uma tupla de valores (x, y). Esta função nunca desenha uma linha.

source: setwidth
pt_br: definir_espessura defina_espessura

source: Modifies the pen width (in pixels)
es_br: Modifica el ancho de la pluma (en píxeles)
pt_br: Modifica a largura do traço (em pixels)

source: show
es_br: mostre
pt_br: mostrar mostre

source: Shows a hidden turtle.
es_br: Muestra una tortuga oculta.
pt_br: Mostra um Tuga oculto.

source: width
es_br: anchura
pt_br: espessura

source: args, kwargs, turtle
es_br: texto, args, kwargs
pt_br: args, kwargs, tuga

source: setspeed
pt_br: definir_velocidade defina_velocidade

source: getspeed
pt_br: obter_velocidade obtenha_velocidade

source: quit
pt_br: sair

source: Type quit() to leave.
pt_br: Digite sair() para sair.

source: cls
pt_br: cos coseno

source: Clear screen
pt_br: Limpar tela

source: sleep(seconds) Delay execution for a given number of seconds. The argument may be a floating point number for subsecond precision.
es_br: dormir (segundos) Retrasar la ejecución por un número determinado de segundos. El argumento puede ser un número de coma flotante para la precisión del subconjunto.

source: Finish program execution.
es_br: Finalizar la ejecución del programa.

source: Turtle representation on client. Client knows the pos, heading, avatar and a dictionary of arbitrary meta values. The client holds a reference to a connection and each method simply sends messages through this connection object.
es_br: Representación de tortugas en el cliente. El cliente conoce la pos, título, avatar y un diccionario de valores meta arbitrarios. El cliente tiene una referencia a una conexión y cada método simplemente envía mensajes a través de este objeto de conexión.

source: clear
es_br: claro

source: self
es_br: yo

source: self, x, y, kwds
es_br: self, teta, x, y, c, s

source: sqrt(x) Return the square root of x.
es_br: sqrt (x) Devuelve la raíz cuadrada de x.

source: exp(x) Return e raised to the power of x.
es_br: exp (x) Vuelve e elevado a la potencia de x.

source: log(x[, base]) Return the logarithm of x to the given base. If the base not specified, returns the natural logarithm (base e) of x.
es_br: log (x [, base]) Devuelve el logaritmo de x a la base dada. Si la base no se especifica, devuelve el logaritmo natural (base e) de x.

source: log10(x) Return the base 10 logarithm of x.
es_br: log10 (x) Devuelve el logaritmo base 10 de x.

source: log2(x) Return the base 2 logarithm of x.
es_br: log2 (x) Devuelve el logaritmo base 2 de x.

source: max(iterable, *[, default=obj, key=func]) -> value max(arg1, arg2, *args, *[, key=func]) -> value With a single iterable argument, return its biggest item. The default keyword-only argument specifies an object to return if the provided iterable is empty. With two or more arguments, return the largest argument.
es_br: max (iterable, * [, default = obj, key = func]) -> valor max (arg1, arg2, * args, * [, clave = func]) -> valor Con un único argumento iterable, devuelva su elemento más grande. El argumento por defecto solo de palabra clave especifica un objeto a devolver si el iterable proporcionado está vacío. Con dos o más argumentos, devuelva el argumento más grande.

source: min(iterable, *[, default=obj, key=func]) -> value min(arg1, arg2, *args, *[, key=func]) -> value With a single iterable argument, return its smallest item. The default keyword-only argument specifies an object to return if the provided iterable is empty. With two or more arguments, return the smallest argument.
es_br: min (iterable, * [, default = obj, key = func]) -> valor min (arg1, arg2, * args, * [, clave = func] Con un único argumento iterable, devuelva su elemento más pequeño. El argumento por defecto solo de palabra clave especifica un objeto a devolver si el iterable proporcionado está vacío. Con dos o más argumentos, devuelva el argumento más pequeño.

source: Return the sum of a 'start' value (default: 0) plus an iterable of numbers When the iterable is empty, return the start value. This function is intended specifically for use with numeric values and may reject non-numeric types.
es_br: Devuelve la suma de un valor 'start' (por defecto: 0) más un iterable de números Cuando el iterable está vacío, devuelva el valor inicial. Esta función está diseñada específicamente para su uso con valores numéricos y puede rechazar tipos no numéricos.

source: round(number[, ndigits]) -> number Round a number to a given precision in decimal digits (default 0 digits). This returns an int when called with one argument, otherwise the same type as the number. ndigits may be negative.
es_br: round (número [, ndigits]) -> número Redondea un número con una precisión dada en dígitos decimales (predeterminado 0 dígitos). Esto devuelve un int cuando se llama con un argumento, de lo contrario el mismo tipo que el número. Ndígitos pueden ser negativos.

source: ceil(x) Return the ceiling of x as an Integral. This is the smallest integer >= x.
es_br: ceil (x) Devuelve el techo de x como un Integral. Este es el entero menor> = x.

source: trunc(x:Real) -> Integral Truncates x to the nearest Integral toward 0. Uses the __trunc__ magic method.
es_br: trunc (x: Real) -> Integral Trunca x al Integral más cercano hacia 0. Utiliza el método mágico __trunc__.

source: random() -> x in the interval [0, 1).
es_br: random () -> x en el intervalo [0, 1].

source: Return random integer in range [a, b], including both end points.
es_br: Devuelve un entero aleatorio en el rango [a, b], incluyendo ambos puntos finales.

source: u, v
es_br: usted, v

source: Returns a perpendicular vector rotated 90 degrees counter clockwise.
es_br: Devuelve un vector perpendicular girado 90 grados en sentido antihorario.

source: self, theta, x, y, c, s
es_br: self, teta, x, y, c, s

source: float(x) -> floating point number Convert a string or number to a floating point number, if possible.
es_br: float (x) -> número de punto flotante Convierta una cadena o número a un número de punto flotante, si es posible.
